<a href="https://colab.research.google.com/github/BingHungLee/BHAI-Daily-Practice/blob/main/%5B20210713%5D_Titanic_Kaggle_LogisticRegression.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import os 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score

In [2]:
!git clone https://github.com/BingHungLee/Dataset.git

fatal: destination path 'Dataset' already exists and is not an empty directory.

In [3]:
cd /content/Dataset

/content/Dataset

In [4]:
Dta_train = pd.read_csv("titanic_train.csv")
Dta_test = pd.read_csv("titanic_test.csv")
Dta_train.head(5)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [5]:
Dta_test.head(5)

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

## Data Preprocessing

In [6]:
len(Dta_train)

891

In [7]:
Dta_train.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [8]:
Dta_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [9]:
X = Dta_train[['Pclass','Sex','Age','Fare','Embarked']]
X

     Pclass     Sex   Age     Fare Embarked
0         3    male  22.0   7.2500        S
1         1  female  38.0  71.2833        C
2         3  female  26.0   7.9250        S
3         1  female  35.0  53.1000        S
4         3    male  35.0   8.0500        S
..      ...     ...   ...      ...      ...
886       2    male  27.0  13.0000        S
887       1  female  19.0  30.0000        S
888       3  female   NaN  23.4500        S
889       1    male  26.0  30.0000        C
890       3    male  32.0   7.7500        Q

[891 rows x 5 columns]

In [10]:
y = Dta_train['Survived'].values
y.shape

(891,)

## Preserve Non-NAN Value

In [11]:
non_nan_row = np.where(X.isnull().sum(axis=1)==0)[0]
non_nan_row.shape

(712,)

In [12]:
X=X.iloc[non_nan_row,:]
X

     Pclass     Sex   Age     Fare Embarked
0         3    male  22.0   7.2500        S
1         1  female  38.0  71.2833        C
2         3  female  26.0   7.9250        S
3         1  female  35.0  53.1000        S
4         3    male  35.0   8.0500        S
..      ...     ...   ...      ...      ...
885       3  female  39.0  29.1250        Q
886       2    male  27.0  13.0000        S
887       1  female  19.0  30.0000        S
889       1    male  26.0  30.0000        C
890       3    male  32.0   7.7500        Q

[712 rows x 5 columns]

In [13]:
X=X.reset_index(drop=True)
X

     Pclass     Sex   Age     Fare Embarked
0         3    male  22.0   7.2500        S
1         1  female  38.0  71.2833        C
2         3  female  26.0   7.9250        S
3         1  female  35.0  53.1000        S
4         3    male  35.0   8.0500        S
..      ...     ...   ...      ...      ...
707       3  female  39.0  29.1250        Q
708       2    male  27.0  13.0000        S
709       1  female  19.0  30.0000        S
710       1    male  26.0  30.0000        C
711       3    male  32.0   7.7500        Q

[712 rows x 5 columns]

In [14]:
y = y[non_nan_row]
y

array([0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1,
       0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0,
       0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0,
       1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1,
       1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0,
       1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0,
       1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0,
       1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1,
       1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0,
       0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0,
       1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0,
       1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0,
       0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1,
       0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1,
       0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0, 0,
       1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1,
       0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0,
       1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0,
       0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1,
       0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1,
       0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0,
       1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1,
       1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0,
       1, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1,
       1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0,
       0, 0, 0, 0, 0, 1, 1, 0])

## Dummy Variables Handle

In [15]:
X

     Pclass     Sex   Age     Fare Embarked
0         3    male  22.0   7.2500        S
1         1  female  38.0  71.2833        C
2         3  female  26.0   7.9250        S
3         1  female  35.0  53.1000        S
4         3    male  35.0   8.0500        S
..      ...     ...   ...      ...      ...
707       3  female  39.0  29.1250        Q
708       2    male  27.0  13.0000        S
709       1  female  19.0  30.0000        S
710       1    male  26.0  30.0000        C
711       3    male  32.0   7.7500        Q

[712 rows x 5 columns]

In [16]:
X = pd.concat([X, pd.get_dummies(X['Pclass']),pd.get_dummies(X['Sex']),pd.get_dummies(X['Embarked'])], axis =1)
X = X.drop(columns=['Pclass','Sex','Embarked'])

In [17]:
X

      Age     Fare  1  2  3  female  male  C  Q  S
0    22.0   7.2500  0  0  1       0     1  0  0  1
1    38.0  71.2833  1  0  0       1     0  1  0  0
2    26.0   7.9250  0  0  1       1     0  0  0  1
3    35.0  53.1000  1  0  0       1     0  0  0  1
4    35.0   8.0500  0  0  1       0     1  0  0  1
..    ...      ... .. .. ..     ...   ... .. .. ..
707  39.0  29.1250  0  0  1       1     0  0  1  0
708  27.0  13.0000  0  1  0       0     1  0  0  1
709  19.0  30.0000  1  0  0       1     0  0  0  1
710  26.0  30.0000  1  0  0       0     1  1  0  0
711  32.0   7.7500  0  0  1       0     1  0  1  0

[712 rows x 10 columns]

## LogisticRegression Model Built

In [18]:
model = LogisticRegression()
model.fit(X,y)

/usr/local/lib/python3.7/dist-packages/sklearn/linear_model/_logistic.py:940: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [19]:
parameters = np.round(model.coef_,2)
parameters

array([[-0.04,  0.  ,  1.19,  0.13, -1.12,  1.32, -1.11,  0.49, -0.25,
        -0.03]])

## LogisticRegression Model Evaluation

In [20]:
#Inside Test
fitted_classes = model.predict(X)
accuracy = accuracy_score(y.flatten(),fitted_classes)
print(accuracy)

0.7963483146067416

## LogisticRegression Model Prediction and Evaluation

In [21]:
X_test = Dta_test[['Pclass','Sex','Age','Fare','Embarked']]
non_nan_row = np.where(X_test.isnull().sum(axis=1)==0)[0]
X_test=X_test.iloc[non_nan_row,:]
X_test=X_test.reset_index(drop=True)
y = y[non_nan_row]

In [22]:
X_test = pd.concat([X_test, pd.get_dummies(X_test['Pclass']),pd.get_dummies(X_test['Sex']),pd.get_dummies(X_test['Embarked'])], axis =1)
X_test = X_test.drop(columns=['Pclass','Sex','Embarked'])
pred_classes = model.predict(X_test)

In [23]:
#Inside Test Evaluate
fitted_classes = model.predict(X_test)
accuracy = accuracy_score(y.flatten(),fitted_classes)
print(accuracy)

0.5287009063444109

## 3-Fold Verification

In [24]:
#3-fold Evaluate
np.random.seed(200)
nfold = 3
idx = np.random.choice(range(nfold),X_test.shape[0]) # randomly split it into 3

PredY=np.ones(X_test.shape[0])


for i in range(nfold):
  testidx=np.where(np.isin(idx,i))[0] #Test Data idx
  trainidx=np.where(np.isin(idx,i,invert=True))[0] #Train Data idx
  #print("testidx :",testidx)
  #print("trainidx :",trainidx)

  TestX=X_test.iloc[testidx,:]  #Test DataX
  TrainX=X_test.iloc[trainidx,:] #Train DataX
  #print("TestX :",TestX)
  #print("TrainX :",TrainX)

  TestY= y[testidx]      #Test DataY
  TrainY= y[trainidx]     #Train DataY
  print("TestY :",TestY.shape)
  #print("TrainY :",TrainY)

  #Train Model
  Trainmodel = LogisticRegression()
  Trainmodel.fit(TrainX,TrainY)

  #Model Predict
  Temp = Trainmodel.predict(TestX)
  accuracy = accuracy_score(TestY.flatten(),Temp)
  print("Temp shape :",Temp.shape)
  print("local accuracy :", accuracy)

  PredY[testidx]=Temp
  #print("PredY :",PredY.shape)
  
accuracy = accuracy_score(y.flatten(),PredY)
print("global accuracy :", accuracy)
df = pd.DataFrame({'Real Values':y, 'Predicted Values':PredY})

/usr/local/lib/python3.7/dist-packages/sklearn/linear_model/_logistic.py:940: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)
/usr/local/lib/python3.7/dist-packages/sklearn/linear_model/_logistic.py:940: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)
/usr/local/lib/python3.7/dist-packages/sklearn/linear_model/_logistic.py:940: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)

TestY : (119,)
Temp shape : (119,)
local accuracy : 0.6134453781512605
TestY : (107,)
Temp shape : (107,)
local accuracy : 0.5233644859813084
TestY : (105,)
Temp shape : (105,)
local accuracy : 0.5428571428571428
global accuracy : 0.5619335347432024